Books/To_Kill_A_Mockingbird/000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-20 Thu 23:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>To Kill A Mockingbird</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">To Kill A Mockingbird</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3773bc9">Navigation</a></li>
<li><a href="#org0bddbfc">Notes &amp; Thoughts</a>
<ul>
<li><a href="#orgb96cddd">Before Starting The Book</a></li>
<li><a href="#org294740e">Chapter 1 - 5 Thoughts</a></li>
<li><a href="#org92dfa15">Chapter 6 - 10 Thoughts</a></li>
<li><a href="#orgb013f0c">Chapter 11 - 15 Thoughts</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3773bc9" class="outline-2">
<h2 id="org3773bc9">Navigation</h2>
<div class="outline-text-2" id="text-org3773bc9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">Books</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Books">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0bddbfc" class="outline-2">
<h2 id="org0bddbfc">Notes &amp; Thoughts</h2>
<div class="outline-text-2" id="text-org0bddbfc">
</div>
<div id="outline-container-orgb96cddd" class="outline-3">
<h3 id="orgb96cddd">Before Starting The Book</h3>
<div class="outline-text-3" id="text-orgb96cddd">
<p>
I often go to half-price books to get textbooks about math, coding, or anything that I would like to learn.
I often feel over-excited when walking out of the store because I tell myself I'm going to become a super-genius after reading all these textbooks.
However, I get ahead of myself because back home I have multiple textbooks I have yet to finish.
</p>

<p>
This time I went to half-price books not to get any textbook but a novel.
I wanted to start reading books right before going to sleep and I have always wanted to read the books that my English class would assign us in high-school but was too-lazy to read.
So I go into the store looking for the book: Fahrenheit 451.
Fahrenheit 451 is a classic book for all high-school students and that was the book I wanted to start reading.
To my disappointment, the store did not have that book and being the impatient person that I am, I did not want to order the book online and wait for it.
I figured there has to be a book other than Fahrenheit 451 that may interest me.
I walked the novel section and noticed a large section dedicated to copies of To Kill A Mockingbird.
I take a glace and recognize this book from my old English class but placed the book back in its place.
I circle the novel section 4-5 times telling myself I don't find anything interesting.
However, I have this bad habit of walking into a book store and always coming out with a book even if I'm not too convinced on the book itself, I just had to come out with a book.
So I go back and find To Kill A Mockingbird.
There are many copies of the book, some in good condition, some in bad condition, some for $5, some for $2.
I find the best condition $2 book there is and I take it home.
</p>

<p>
The book was laying on my nightstand for about a month without ever picking it up.
Until one night I told myself let's start the book.
I started to read a couple of pages but then stopped.
Another month past by without picking up the book again.
Finally, I decided if I don't try to consistently read then I'm never going to finish the book and my two bucks will go to waste.
So I told myself each night before going to bed try to read one chapter.
Since the day I told myself to read one chapter a night, I haven't missed since.
</p>
</div>
</div>

<div id="outline-container-org294740e" class="outline-3">
<h3 id="org294740e">Chapter 1 - 5 Thoughts</h3>
<div class="outline-text-3" id="text-org294740e">
<p>
The first 5 chapters introduces us to our characters, the main character Jean (Scout), Jeremy (Jem), Atticus (father of Scout and Jem and a lawyer), Jack (brother of Atticus and a doctor), Dill (nephew of Miss Rachel), Rachel (neighboor to the Finch family), Calpurnia (cook and caretaker of the Finch residence), the Radley family (a mysterious family), Boo Radley (Arthur Radley), Miss Maudie (a widow living in the neighboorhood), Miss Stephanie Crawford (a gossiper in the neighboorhood), the Cunningham family (a poor family who lives off the land), Ewell family (a trouble maker family), and more.
It starts us off with Jean and Jem meeting Dill. Dill only visits his aunt in the summer and begin fascinating over the Radley family.
The Radley family is a mysterious family who are not often seen but much talked about.
Gossip spreads about the Radley family from Miss Stephanie Crawford to the children that live in MayComb County.
It is said the Boo or Arthur Radley had stabbed his father in the leg and has gotten into trouble when he was younger.
These rumors led to the kids, Jean, Jem, and Dill to be afraid of the Radley residence.
</p>

<p>
As time went on we see Jean get ready to go to her first year of school.
Jean notices Calpurnia behave differently from a very strict caretaker who always seems to pick on her to a nicer caretaker.
This is what I love about this book is that the perspective is from a child.
Jean makes it seems like Calpurnia is strict with her and not her brother for whatever reason.
Jean thinks is unjunst and not fair. However, we later realize that Calpurnia really cares about Jean especially because she is younger than Jem and a girl.
Calpurnia wants to take care of Jean and when Jean goes off to school, Calpurnia misses her and behaves differently because Jean is no longer within calling distance.
As an adult reading this you first agree with the main character. Why is Calpurnia harder on Jean?
Well that is because Calpurnia is trying to take care of Jean.
We have all experienced this. When we are kids and the people looking out for us always seem to be "mean" to us by not letting us do whatever we want.
However, they are simply trying to take care of us because they love us.
Sometimes, we don't think about it because we are grown now, but reading the book made me look back at my childhood and relate to Jean.
</p>

<p>
As Jean gets ready to go to school, Jean is ahead of her peers.
Jean already knows how to read because of father and was taught how to write by Calpurnia.
However, when she demonstrates these skills in school her teacher gets mad at her.
She returns home upset at Calpurnia for teaching her to write and is upset at her father because he is rejecting her plea to let her not go to school anymore.
Eventually her father tells Jean they will continue to read despite what her teacher told her and she will continue to go to school.
As a reader I was upset that Jean was getting in trouble for knowing how to read or write.
The author does a great job for the reader to like the main character and root for her.
I was hoping for the main character to get the last laugh between her and her teacher but soon enough school was over and it was summer time.
</p>

<p>
Summer time arrived and it was time for Dill to come stay with his aunt.
Dill was the type of kid to often say lies and Jean soon realized he lied often.
Nevertheless, as the summer went over the kids, Jean, Jem, and Dill begin to play a game where they would try to reenact the life of the Radley family.
Jean didn't like the idea because she was afraid of the Radley family and thought if they spoke about them especially Boo, they would know.
Eventually Jean becomes excluded from playing with Dill and Jem and finds herself talking to Miss Maudie.
Up to this point what we know from Boo Radley comes from the perspective of the kids, he likes to eat cats, likes to spy on people in the night (according to Miss Stephanie Crawford) and may be dead and his body may be hidden in the chimney.
As Miss Maudie and Jean talk about Boo, we now begin to get the perspective of an adult.
Miss Maudie says the Radley father are strict Baptists that often think any type of "pleasure" is a sin and that the family prefer to stay inside.
Miss Maudie states to her and Jean what they find weird may be normal to the Radleys and what the Radleys might find weird may be normal to them.
And this is why I'm starting to enjoy the book so much. I sometimes forget that we are reading through the perspective of a child.
I was also convinced that the Radley place was this evil or dark pressence but Miss Maudie shed some light and indicated they might not be so evil afterall they might just live a different lifestyle.
It makes me remember of my childhood. How easy rumors and a child's imagination would wonder.
How a child's innonence and lack of knowledge can lead to a vast imagination.
It makes me happy to be able, in a way, go back and be a child again, lack the knowledge (e.g. not know who are the Radleys), and let our imagination (with the main character) run wild.
Being an adult is sometimes stressful with the world events, work, and every other thing, that reading this book takes me back into thinking like a child where you let your imagination free and worried about the silliest things. 
</p>

<p>
Chapter 5 ends with Dill, Jem, and Jean trying to take out Boo out of his home and join them. However, they were soon caught by Atticus and told to stop.
</p>
</div>
</div>

<div id="outline-container-org92dfa15" class="outline-3">
<h3 id="org92dfa15">Chapter 6 - 10 Thoughts</h3>
<div class="outline-text-3" id="text-org92dfa15">
<p>
The book continues with Dill, Jem, and Jean trying to take a look at the Radley's place.
They try to sneak in through the backyard but were almost caught by Mr. Nathan Radley who shot in the air to scare the intruder away.
While fleeing Jem's pants got stuck in the fence and were ripped apart.
Later Jem goes back to retrieve his pants and finds their pants patched up.
However, Jem knew whoever patched them up was a guy because they were not sewed together correctly.
This made me think, could it be Boo? Somebody has been leaving stuff in the knothole for Jem and Scout. Could that be Boo as well?
It made me believe Boo was not the evil person the kids thought of but rather a nice person trapped by his own family.
The reason why I believed that is because the knothole was covered with cement by Mr. Nathan Radley.
Mr. Radley said it was because the tree was dying but when Jem asked his father if he thinks the tree was dying, Atticus said he didn't think so.
I think Mr. Radley did so because he wanted to stop Boo from giving gifts to Jem and Jean thus showcasing Boo is trapped by his own family.
</p>

<p>
As the story moves along, winter comes and Miss Maudie house catches fire. While the kids are outside in the freezing cold someone gives Jean a blanket.
She didn't realize that had happened or who did it. However, it was Boo again who placed the blanket on Jean.
I think the kids are starting to realize the gifts in the knothole, the patched up pants, and the blanket were all Boo, but are not 100% confident.
However, as we continue to read we begin to realize the kids start shifting away from imagining how Boo Radley is to real life problems.
Cecil Jacobs start to antagonize Jean by calling her father names because he is a lawyer defending a black man named Tom Robinson.
Even her own family members start to despise Atticus for doing such a thing, letting his children run "wild", and never able to make the right decision.
However, I think Atticus is quite the opposite. Atticus knows exactly what he is doing and is doing the right decision.
Atticus represents fairness, reason, justice, and honest.
Atticus knows the black man is innocent and he will fight to prove it.
Atticus knows he is raising his kids right because he is trying to make them honest, fair, and non-violent.
This is why he says to the kids do not kill the mockingbirds because they do nothing wrong against them.
In a way, Atticus, Tom, and the kids are mockingbirds and Maycomb County are trying to bring them down.
Atticus instructors to Jean to never fight and keep a cool head and he tells his boy to always be a gentleman even if people provoke him.
Atticus represents good in a place filled with evil.
It reminds me of Boo and his home.
Boo is good in a placed filled with evil.
</p>

<p>
Finally, the chapter ends with the kids describing their father.
In the eyes of the kids their father is old and unskilled.
Nothing to be praised.
They don't realize how good of a person Atticus is because they are kids and do not pay attention to that.
They pay attention to other things. For example, they see other fathers play football, go hunt, or fish.
Their father does none of that.
But the kids were left speechless when a "wild dog" (a dog with rabies) came into town and the town relied on Atticus.
The sheriff gave the rile to Atticus to take the shot and he took the shot as smooth as it could be and the dog fell.
Miss Maudie then told the kids that Atticus was the best shooter in town when he was younger.
The kids were left impressed and Jean wanted to tell the whole school but Jem instructed her not to because if Atticus didn't tell them himself then that means he probably didn't want people to know.
I think this is a bit of foreshadowing of how the kids look at their father.
Previously they looked at their father as this old and unskilled person but now they look at him different.
The town depended on Atticus on his courage and bravery but Atticus believes courage and bravery is not about violence but other means.
I think later we are going to see the kids realize their father is a good, brave, and honest person not because of his shot but because of other actions.
</p>
</div>
</div>

<div id="outline-container-orgb013f0c" class="outline-3">
<h3 id="orgb013f0c">Chapter 11 - 15 Thoughts</h3>
</div>
</div>
</div>
</body>
</html>
